{
  "reviews": {
    "512da504-505b-4aca-b9f0-77f302dd29a8": {
      "name": "Steven Jones",
      "title": "Sekiro: Shadows Die Twice",
      "genre": "Action-adventure",
      "review": "This is a game about fighting through a supernaturally tinged recreation of 16th-century Japan as a deathless assassin with a sharp blade and a weaponized prosthetic arm, but there are plenty of moments when the sword is sheathed and the game shows a quiet cinematic discipline. A castle aflame on a hilltop, illuminating the gardens and courtyards below in the dead of night. Stolen minutes crouched hidden on rooftops, surveying patrolling guards, or strolling up an avenue lined with blossoming trees. Short, opaque conversations with dying samurai. Hiding in tall grass from a gigantic, bone-chilling serpent that tastes the air with its flickering tongue as it slithers massively through a valley. I have seen some extraordinary things in Sekiro: Shadows Die Twice, and still, after weeks, there is more ahead. Sekiro's set-piece fights are breathtaking, clashing songs of steel whose different rhythms defy familiarization. Fighting a hooded shinobi-hunter with a spear is a different dance from fighting a general on horseback, or an elite swordsman, or a flaming beast. Avoiding attacks is usually impossible; instead, you must deflect them with your blade, seizing each momentary opening to retaliate with your own slash, until an enemy's posture is broken and they're left open to a finishing blow. In between these fights are castles, valleys, courtyards and dungeons full of lesser enemies, treasures, and rare friendly characters offering scant crumbs of conversational comfort or wares for sale. Each area is a puzzle: figure out where to hide, and when to escape to the rooftops, and you can stealthily slice through five or six unfortunate soldiers before anyone realizes you're there. Being outnumbered swiftly leads to your demise, so thinning out the ranks with stealth strikes and plunging blows from tree branches is vital. Sekiro leaves no room for lapses of concentration. Three or four hits are usually enough to finish you off, and bosses can sometimes end you with a single undeflected strike. Dying means returning to prayer idols scattered throughout the world, small oases that mark your progress. There are minimal punishments for failure in Sekiro's world, as your shinobi can resurrect himself as often as needed. It expects you to die, over and over, until you develop the muscle memory to get past whichever bastard keeps bringing you down. In most difficult games, including director Hidetaka Miyazaki's previous masterworks Dark Souls and Bloodborne, slow inch-by-inch progress can be made even when your skills or your nerves aren't quite up to the latest towering foe. You can mop up less intimidating enemies to increase your stats or your confidence, hunt for a different weapon that might be more effective, try changing your tactics, or turn to other players for assistance. In Sekiro, there is no help, little strategy, no missing piece of the puzzle: just you and a sword. It's not unusual to spend two or three hours repeatedly fighting the same adversary, hoping that THIS attempt will be the one, THIS will be the time where your reflexes or your nerves don't fail you. This makes Sekiro uncompromising. The rush when you finally run your sword through a samurai general for the final time is incomparable - after one battle the adrenaline was so strong I could physically taste it - but the preceding hours of trying and failing often drove me to despair. It offers no comforting sense of gradual progress, but a series of ever-ascending peaks. This is no accident. Sekiro's designers invite you to fully inhabit the role of a shinobi, to develop skills as sharp and unfailing as a real ninja swordsman, and to think deeply about death. But it is regrettable that this also closes off a fascinating game to anyone without the time to devote to it. It is time, more than anything, that will determine whether you can experience Sekiro. Anyone can develop the skills, with practice, but not everyone is willing to spend so long throwing themselves at a brick wall. This is not a game you can chip away at, but one whose every challenge requires hours of sustained application. And some of its imposed sufferings, such as a currency for helpful special moves that sometimes runs dry and leaves you without even that small advantage, or being repeatedly forced to face the same five bodyguards before getting another shot at the general they are guarding, feel cruel and needless. If you're at a point in life where you have frequent long evenings or empty weekends to throw at its mountainous challenges, you will find here an exquisite game whose subtle themes, gradually unfurling mysteries and beautiful samurai-period sights reward the determined and skilled player. Otherwise, Sekiro is a stubbornly locked treasure chest.",
      "imageUrl": "https://images.alphacoders.com/942/942234.jpg",
      "_ownerId": "35c62d76-8152-4626-8712-eeb96381bea8",
      "_id": "512da504-505b-4aca-b9f0-77f302dd29a8"
    },
    "9dba1699-8411-4a3f-8682-bf9821ee43c6": {
      "name": "Franklin Smith",
      "title": "Batman: Arkham Knight",
      "genre": "Action-adventure",
      "review": "Under the perpetually stormy skies of Gotham City, the Caped Crusader is put through trial after trial; test after test. This is a game about madness, about prevailing darkness and about heroes failing. The horror of failure is something Batman succumbs to, and is punished with, at major points throughout Arkham Knight's 10-12 hour storyline. It's gripping - sometimes almost unpleasantly so - to see through to the end. Building on the open-world structure that Arkham City debuted in 2011, Knight is simply an expansion of that vision. This new Gotham is a large trifecta of distinct areas, each with their own neighborhoods and interesting sights, stretching from a gothic city underbelly, to the gleam of cloud-piercing skyscrapers. Much like its predecessors, Arkham Knight's world feels expansive but handcrafted, rich with detail and teeming with stuff to find, whether that's clues to cases, nods to DC lore, or the hundreds of Riddler trophies waiting to be solved. Arkham Knight sets up its side content in interesting ways, pacing new leads as you progress instead of just dumping dozens upon dozens of mission markers on to your map at any one time. Your mission wheel keeps track of everything, and selecting a different quest to focus on sparks neat conversational cues between Batman and Alfred, allowing you to always keep track of the context of each mission and where you are in its plot. It's simple but really effective, and much more organic than the overly apparent percentage completion markers that hang over each segment of your mission wheel. You'll track down mutated monsters, investigate the ongoing gruesome murders of a mysterious serial killer, put a stop to ongoing bank heists, and more. All of these require you to be aware of your surroundings - a burning building, a flaming bat symbol on rooftops, or the sudden cacophony of some operatic music nearby may indicate you should investigate. It's often a bit vague - Arkham Knight really does let you loose and free, and in a world this size it's not as easily readable as the more dense Arkham City - but the thrill of chasing the majority of these clues is still intoxicating. Some side mission threads are slightly arbitrary 'retake the city' objectives like tower takeovers and tank chases, but they make enough out of the game's individual mechanics - its combat, its freedom and its movement - to still be enjoyable. The final piece of the puzzle that really completes The Batman Experience is the Batmobile - Arkham Knight's one truly new plaything. The vehicle essentially boils down to two modes, “car” and “tank”, and it's an addition of two distinct halves, both of varying success. As a traversal tool used to roar down Gotham's wider streets, it's a strong and exciting addition to your arsenal that never becomes superior to flying. Driving it around the city is surprisingly streamlined, thanks to simple controls and the fact that you can boulder through pretty much any object and watch it crumble. Activating it in combat as a remote ally is excellent fun, and the numerous chase sequences are a great way of testing your driving skills and seeing just how much collateral damage you can rack up. As a tank used for combat, Rocksteady overuses it to its detriment. It's a tool that's forced upon you too often and in repetitive ways. The Arkham series has always been at its best when it's up close and personal, and the Batmobile only serves to distance the player from the game's gristle. You'll take down unmanned drone tanks in all-out street combat and it's a visually impressive affair with flashy neon explosions and slow-mo Burnout-style car takedowns, but halfway through the game you're forced to stealth-kill Cobra tanks which are by far the game's most frustrating, least Batman-like offering. The only real downside to a wonderfully polished experience.",
      "imageUrl": "https://wallpaperaccess.com/full/783500.jpg",
      "_ownerId": "847ec027-f659-4086-8032-5173e2f9c93a",
      "_id": "9dba1699-8411-4a3f-8682-bf9821ee43c6"
    },
    "839747a7-3bcb-4fc9-82d4-b4e577708ae3": {
      "name": "Jack Rogers",
      "title": "Dark Souls III",
      "genre": "Action role-playing game",
      "review": "Dark Souls III is a game of valleys and peaks, down through dungeons and up over castle walls. It's a plummet into places we shouldn't be. But of course, we fight our way through the darkness, and find our way out. There are a few stumbles along the way, but in the end, Dark Souls III is well worth the riveting climb. This is the third in a series of dark fantasy role-playing games known for their brutal difficulty and unforgiving nature. It gives minimal direction and little room for error. As with its predecessors, playing Dark Souls III means accepting two extremes: recurring defeat, and the reward of breaking through it. This is a game that recognizes the value of perseverance, tearing you down before it pulls you back up, reinforcing the spots where it broke you, preparing you for that next valley just down the road. The world itself is a disconnected series of detailed areas--some sprawl outward, while others stack on top of themselves, folding back and looping around in intricate webs. It's a testament to the level design that discovering a bonfire checkpoint is as important as levelling your character or defeating a challenging boss. In this dangerous world of swamps, prisons, and undead villages, every milestone is a victory. Returning to the Firelink Shrine hub world in order to level up character stats, weapon quality, and the health-imbuing estus flask seems tedious at first, but as time goes by, you'll recruit helpful companions that set up camp at your base, granting useful items and buffs throughout your walkthrough. Bonfire checkpoints strewn throughout Dark Souls III allow for easy fast travel, and returning to Firelink becomes a welcome reprieve from the surrounding world. This macabre locale has subtle stories to tell. Giants bow their heads in exhaustion among the rafters of the Cathedral of the Deep. A sense of mystery pervades Dark Souls III's gloomy world, and there's a confidence on display that's often missing from many modern games. It's also impressive how Dark Souls III strikes a balance between exploration and guidance. There's usually more than one path you can take through the world at any time, or new areas entirely. The level design encourages wandering without losing focus. Obstacles come in a variety of grotesque forms along the way: hulking giants and feral dogs; ancient knights and suicidal monks. Each enemy is a unique threat, and in groups, they grow more dynamic and punishing, demanding a flexible approach to combat. Dark Souls III is also clever in the way it plays on your false sense of comfort: many deaths come when you underestimate an enemy you've killed dozens of times before. The danger is always lurking. In the long run, survival requires patience. Some enemies are weak near their sword arm. Instinct may tell you to dodge every time a knight retracts its spear, but wasting stamina could lead to a quick death, forcing a restart at the most recent bonfire. Dark Souls III doesn't just teach you new skills. The combat fluctuates between measured duels and frantic fights, but it almost always manages to keep things fair: you may be outnumbered and underpowered, but defeat is usually your fault. Sometimes, however, Dark Souls III breaks that rule. The camera often struggles to adjust in tight spaces, and the lock-on mechanic can be capricious, especially against Dark Souls III's more mobile, aggressive enemies. In boss fights that require precision, an imprecise camera becomes all the more of a hindrance. But what impressive monstrosities these bosses can be. In fact, several display more creativity than any others in developer From Software's RPG lineup. These creatures play on your expectations and force you to adapt. One boss fight pits you against a crowd of pyromancers that inches toward you, hinting at its weakness with subtle visual cues. Intuition tells you to keep your distance, but it soon becomes clear you'll need to enter the fray. It rips you out of your comfort zone at a harrowing pace. Despite the nuance and novelty of most bosses, however, some stick to familiar ground. Deja vu kicks in during several fights, when the monsters display move sets similar to those that came before them, diminishing the creativity displayed elsewhere. I brought down Pontiff Sullyvahn, the Consumed King, and even Aldrich - a boss the game purports to be one of my major targets - with tactics I had used hours earlier. These enemies feel recycled. They feel repetitive. The skin may be different, but the beast remains the same. One glaring design misstep involves a boss requiring a specific item to bring him down. There is an earlier, obscure side quest that removes the need to use that item. But many players might not stumble upon it. Dark Souls is at its best when it rewards your growth, and tests your character's hard-earned experience.",
      "imageUrl": "https://cdn.mos.cms.futurecdn.net/tNU5WexQHP9HJQktT53riB.jpg",
      "_ownerId": "60f0cf0b-34b0-4abd-9769-8c42f830dffc",
      "_id": "839747a7-3bcb-4fc9-82d4-b4e577708ae3"
    },
    "371941a0-f89b-446a-8d7c-b9d12a18f96c": {
      "name": "Steve Rogers",
      "title": "God of War Ragnarök",
      "genre": "Action-adventure, hack and slash",
      "review": "God of War Ragnarok is a great game, with eventually weighty emotional moments, incredibly satisfying puzzles, and combat that's never less than enjoyable. The only thing letting it down is that developer Sony Santa Monica doesn't really know what to do with the first half of the experience. After an incredibly emotional opening (be warned, there will be tears) the wheels sort of spin for a while with no clear direction. There's always something to do, or an objective to chase, but some sort of spark is missing and the momentum that finally picks up and barrels you through the ending takes a while to get going. The 2018 game crackled with energy as Kratos and Atreus struggled with grief and each other - the growing pains of both Kratos' fatherly responsibilities and Atreus' burgeoning adulthood could make almost any moment an emotional experience or friction filled clash of wills. Kratos famously states in the previous game during a key event, and here that doesn't feel the case for while. The pair operate as a functional team (more or less) and while Ragnarok is coming, little seems to change at first. As a result, the opening hours struggle to find any sense of weight. God of War Ragnarok is still great to play at this point, but for the first 15 hours or so it feels like it's treading water; stretched out and playing for time. Almost everything you do in this period has basically a minimal net gain. At best, you'll earn a small plot advancement that doesn't quite feel like adequate pay off for the time it took. Kratos continues to be one of the most interesting character reformations in video games, and by the time the credits rolled I was happy for him in a way I wasn't expecting. He suffers most from the slow start, feeling barely present at times, but both he and Atreus ultimately go on a journey in every sense of the word. And, of the two, it's him that travels furthest. In terms of overall progression and gameplay, God of War Ragnarok feels a little more focused than its predecessor, often with more linear and direct paths to main objectives that reward you with an open area of side quests to explore once a crucial objective has been ticked off. There's also more in the way of puzzles - just about every door needs something spun, burned, or whacked in some way. They're just the right level of challenge to always feel satisfying, although it feels like the early stages are either playing for time or not big enough to properly space the puzzles out. At the start you can barely take a step without having to trigger a mechanism somewhere. As the story picks up and becomes more meaningful, there's a little less busy work and the open areas you unlock expand in scope. They're all fairly self-contained but stack up, crisscrossing the realms, to create a pleasing raft of side missions to snack on - ghosts that need help, Nornir chests to open, fights and monsters to beat, and more. Earlier areas can be cleared quite quickly, and you'll rarely ever find a side quest that takes more than a few minutes, but by the time you're finished the story there's a generous helping of stuff to keep it going. One area in particular has a real endgame vibe as well, with a level of complexity and layering far exceeding the rest, which will take some time to unravel. I finished the story somewhere around the 35 hour mark, with a fair amount of wandering and side stuff under my belt and now, around 45-50 hours in, I'm still exploring and finding new stuff. There's obviously a lot of fighting as you explore all this, and the combat continues to feel heavy and impactful, even as Ragnarok introduces more simplified systems. The core of combat is still balancing the focused icy damage of Kratos' Leviathan Axe to wail on single enemies, while the fiery hell of his Blades of Chaos burn everything around you. The enchantment system, which let you add buffs to gear in the previous game, has now been moved to a single amulet that can take nine enchantments. Each one buffs different stats like health, damage, and so on, but come as part of a trio - matching two or three of the set then powers up a different perk. It's much easier to manage a build in Ragnarok, particularly as different armor sets are more clearly focused on damage, cooldowns, Runic (magic) and other key stats.",
      "imageUrl": "https://wallpapercave.com/wp/wp11484883.jpg",
      "_ownerId": "61814ab5-fa7f-4140-88a8-0daa67cbd40f",
      "_id": "371941a0-f89b-446a-8d7c-b9d12a18f96c"
    },
    "d9437153-7a32-47ff-a325-177c01fd0656": {
      "name": "Frank Stone",
      "title": "Elden Ring",
      "genre": "Action role-playing game",
      "review": "Elden Ring differs from its predecessors in its expanse: every hillcrest represents a fresh opportunity. If one path seems too foreboding, one dragon too fearsome, one group of cackling dancers too disconcerting, you can simply ride off in another direction. The rhythms of struggle, setback, perseverance and, finally, triumph familiar to any player of Miyazaki's work are present here, and exquisitely refined. But the frustrations have been eased; there is always another alluring path wending into the horizon, another cave entrance hidden in the bushes, another mineshaft down to a subterranean cathedral city. This is an ancient world. Old battles have left scars on the earth: toppled statues, rotting fortifications, charred ground where the grass is yet to regrow. Game of Thrones's creator George RR Martin provided Elden Ring's history, a narrative foundation on which Miyazaki and his team have carefully built. But don't expect House Lannister-style intrigue; this is not a story game in any traditional sense. There are no tedious cinematics to endure. Any character you meet who wants to talk, rather than fight, will offer only fragments of clues about the world and your purpose within it. What is clear, however, is that Elden Ring wants you dead or banished, and you must scavenge whatever resources and alliances you can to resist extinction. Newcomers have much to learn, but Elden Ring is a more welcoming game than its predecessors. While there are hundreds of different weapons to find and forge, even your chosen character's starting arsenal, once improved by the relevant blacksmith, will remain workable for dozens of hours. Provided you've wooed them correctly, friendly characters or other players can be summoned to provide support during the most challenging battles with the game's hellish monstrosities, and it's now possible to conjure a variety of spectral warriors to provide additional backup. As in Miyazaki's previous games, you are never entirely alone in Elden Ring. The ghostly outlines of other players occasionally flicker on-screen as you roam its world. Later, hostile players may enter to hunt you - and others can be summoned to your defense. Combat in Elden Ring is unmatched by any other game, with a sense of heft and precision that rewards patience and learning, whether battling with weapons or spells. You can fight on the ground or, if you prefer, on horseback, galloping around a foe before retreating to a safe distance. Your steed, Torrent, is a revelatory introduction, clambering sheer rockfaces like a mountain goat, enabling thrilling getaways with his pace and nimbleness. It is possible to gallop across a misted lake, wake and draw a dragon from the mouth of the cave it guards, then dip inside, loot the treasure from horseback, and make your escape. Miyazaki and his team prize secrets, and opening up the world has multiplied the possibility for riddles, conundrums and treasure hunts. There is a deep sense of wonder and excitement whenever you happen upon a cave mouth on some out-of-the-way shoreline that leads to a warren of trinkets - and the ghostly graffiti that other players can leave to point others toward these points of interest has never been more useful. Miyazaki's worlds have always felt like elegant contraptions, with secret passages and delicious shortcuts that provide “ah-ha” moments as the architectural logic is revealed. That sense of watchmaker's vision is only heightened by Elden Ring's expanded scale, and minute details (the skeletons who, once reformed from a pile of bones, tap their heads down into place) ensure Elden Ring delights from every angle. It is not an accomplishment in itself for a game to be large, or long. An algorithm could theoretically toss off a virtual universe, and another could fill it with busywork. It is inane to equate scale with value and enrichment. Elden Ring's hills, valleys, mountaintop settlements and underground palaces offer something far rarer: true texture, variety, and long-term intrigue. This is a massive world, astonishingly rendered (the sun and moon wheel in the sky, casting each scene anew) and seemingly limitless in its creative diversity. It is an unrivalled feat of design and inventiveness. For Miyazaki, Elden Ring represents the actualization of a vision he and his team have refined for more than a decade. Technology has finally provided the power to meet their expansive imaginations. Video games can be all kinds of different things, representing all manner of artistic ambitions. Most, however, share a common goal: to conjure a compelling fictional reality, filled with beckoning mysteries, enchanting secrets, and enriching opportunities to compete and collaborate. They aim to provide a liminal space in which a determined player can fix that which is broken, order that which is chaotic. By this definition, at least, Elden Ring is the finest video game yet made. Its final gift is the assurance that, whatever monsters lurk in a broken world, with perseverance and cooperation, they too can be overcome - all without losing the mystery and wonder that makes our existence beguiling, infuriating, and fascinating.",
      "imageUrl": "https://c.wallhere.com/photos/da/61/Elden_Ring_Maliketh_Dark_Souls-2088873.jpg!d",
      "_ownerId": "20df96d4-9c12-44df-aeaa-90839f7abb69",
      "_id": "d9437153-7a32-47ff-a325-177c01fd0656"
    }
  },
  "comments": {
    "839747a7-3bcb-4fc9-82d4-b4e577708ae3": {
      "ae2da0a-c2c5-4fc9-a928-4e189951e6d1": {
        "name": "Peter Parker",
        "comment": "Lorem ipsum dolor sit amet consectetur adipisicing elit",
        "_ownerId": "60f0cf0b-34b0-4abd-9769-8c42f830dffc",
        "_id": "ae2da0a-c2c5-4fc9-a928-4e189951e6d1"
      },
      "aee1fb0a-c2c5-4fc9-a928-4e189951e6d1": {
        "name": "Alan Walker",
        "comment": "Lorem ipsum dolor sit amet",
        "_ownerId": "35c62d76-8152-4626-8712-eeb96381bea8",
        "_id": "aee1fb0a-c2c5-4fc9-a928-4e189951e6d1"
      },
      "aee1fb0a-c2c5-4fc9-a928-4e233211e6d1": {
        "name": "Louis Lane",
        "comment": "Lorem ipsum dolor sit amet consectetur",
        "_ownerId": "847ec027-f659-4086-8032-5173e2f9c93a",
        "_id": "aee1fb0a-c2c5-4fc9-a928-4e233211e6d1"
      }
    },
    "512da504-505b-4aca-b9f0-77f302dd29a8": {
      "b865e2b0-0fd4-4c46-b2ab-26fb0bd98c63": {
        "name": "Steve Rogers",
        "comment": "Lorem ipsum",
        "_ownerId": "847ec027-f659-4086-8032-5173e2f9c93a",
        "_id": "b865e2b0-0fd4-4c46-b2ab-26fb0bd98c63"
      },
      "9dba12399-8411-4a3f-8682-bf9821ee43c6": {
        "name": "Jason Todd",
        "comment": "Lorem ipsum dolor",
        "_ownerId": "60f0cf0b-34b0-4abd-9769-8c42f830dffc",
        "_id": "9dba12399-8411-4a3f-8682-bf9821ee43c6"
      }
    }
  }
}
